import {ref} from 'vue'

const provincesData = ref([
    {
        name: "北京",
        cities: ["北京市"],
    },
    {
        name: "天津",
        cities: ["天津市"],
    },
    {
        name: "河北",
        cities: ["石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水"],
    },
    {
        name: "山西",
        cities: ["太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁"],
    },
    {
        name: "内蒙古",
        cities: ["呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "兴安盟", "锡林郭勒盟", "阿拉善盟"],
    },
    {
        name: "辽宁",
        cities: ["沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"],
    },
    {
        name: "吉林",
        cities: ["长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城"],
    },
    {
        name: "黑龙江",
        cities: ["哈尔滨", "齐齐哈尔", "鸡西", "鹤岗", "双鸭山", "大庆", "伊春", "佳木斯", "七台河", "牡丹江", "黑河", "绥化", "大兴安岭"],
    },
    {
        name: "上海",
        cities: ["上海市"],
    },
    {
        name: "江苏",
        cities: ["南京", "无锡", "徐州", "常州", "苏州", "南通", "连云港", "淮安", "盐城", "扬州", "镇江", "泰州", "宿迁"],
    },
    {
        name: "浙江",
        cities: ["杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水"],
    },
    {
        name: "安徽",
        cities: ["合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "阜阳", "宿州", "六安", "亳州", "池州", "宣城"],
    },
    {
        name: "福建",
        cities: ["福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德"],
    },
    {
        name: "江西",
        cities: ["南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶"],
    },
    {
        name: "山东",
        cities: ["济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "临沂", "德州", "聊城", "滨州", "菏泽"],
    },
    {
        name: "河南",
        cities: ["郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店"],
    },
    {
        name: "湖北",
        cities: ["武汉", "黄石", "十堰", "宜昌", "襄阳", "鄂州", "荆门", "孝感", "荆州", "黄冈", "咸宁", "随州", "恩施", "仙桃", "潜江", "天门", "神农架"],
    },
    {
        name: "湖南",
        cities: ["长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底", "湘西"],
    },
    {
        name: "广东",
        cities: ["广州", "韶关", "深圳", "珠海", "汕头", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远", "东莞", "中山", "潮州", "揭阳", "云浮"],
    },
    {
        name: "广西",
        cities: ["南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左"],
    },
    {
        name: "海南",
        cities: ["海口", "三亚", "三沙", "儋州"],
    },
    {
        name: "重庆",
        cities: ["重庆市"],
    },
    {
        name: "四川",
        cities: ["成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广元", "遂宁", "内江", "乐山", "南充", "眉山", "宜宾", "广安", "达州", "雅安", "巴中", "资阳", "阿坝", "甘孜", "凉山"],
    },
    {
        name: "贵州",
        cities: ["贵阳", "六盘水", "遵义", "安顺", "铜仁", "黔西南", "毕节", "黔东南", "黔南"],
    },
    {
        name: "云南",
        cities: ["昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "文山", "红河", "西双版纳", "大理", "德宏", "怒江", "迪庆"],
    },
    {
        name: "西藏",
        cities: ["拉萨", "日喀则", "昌都", "林芝", "山南", "那曲", "阿里"],
    },
    {
        name: "陕西",
        cities: ["西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛"],
    },
    {
        name: "甘肃",
        cities: ["兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "张掖", "平凉", "酒泉", "庆阳", "定西", "陇南", "临夏", "甘南"],
    },
    {
        name: "青海",
        cities: ["西宁", "海东", "海北", "黄南", "海南", "果洛", "玉树", "海西"],
    },
    {
        name: "宁夏",
        cities: ["银川", "石嘴山", "吴忠", "固原", "中卫"],
    },
    {
        name: "新疆",
        cities: ["乌鲁木齐", "克拉玛依", "吐鲁番", "哈密", "昌吉", "博尔塔拉", "巴音郭楞", "阿克苏", "克孜勒苏", "喀什", "和田", "伊犁", "塔城", "阿勒泰", "石河子"],
    },
    {
        name: "台湾",
        cities: ["台北", "新北", "桃园", "台中", "台南", "高雄", "基隆", "新竹", "嘉义"],
    },
    {
        name: "香港",
        cities: ["香港岛", "九龙", "新界"],
    },
    {
        name: "澳门",
        cities: ["澳门半岛", "氹仔岛", "路环岛"],
    },
]);

const movieTypeOption=ref([
    {
        value:"爱情",
        label:"爱情",
    },
    {
        value:"喜剧",
        label:"喜剧",
    },
    {
        value:"动画",
        label:"动画",
    },
    {
        value:"剧情",
        label:"剧情",
    },
    {
        value:"恐怖",
        label:"恐怖",
    },
    {
        value:"惊悚",
        label:"惊悚",
    },
    {
        value:"科幻",
        label:"科幻",
    },
    {
        value:"动作",
        label:"动作",
    },
    {
        value:"悬疑",
        label:"悬疑",
    },
    {
        value:"犯罪",
        label:"犯罪",
    },
    {
        value:"冒险",
        label:"冒险",
    },
    {
        value:"战争",
        label:"战争",
    },
    {
        value:"奇幻",
        label:"奇幻",
    },
    {
        value:"运动",
        label:"运动",
    },
    {
        value:"家庭",
        label:"家庭",
    },
    {
        value:"古装",
        label:"古装",
    },
    {
        value:"武侠",
        label:"武侠",
    },
    {
        value:"西部",
        label:"西部",
    },
    {
        value:"历史",
        label:"历史",
    },
    {
        value:"传记",
        label:"传记",
    },
    {
        value:"歌舞",
        label:"歌舞",
    },
    {
        value:"黑色",
        label:"黑色",
    },
    {
        value:"电影",
        label:"电影",
    },
    {
        value:"短片",
        label:"短片",
    },
    {
        value:"纪录片",
        label:"纪录片",
    },
    {
        value:"戏曲",
        label:"戏曲",
    },
    {
        value:"音乐",
        label:"音乐",
    },
    {
        value:"灾难",
        label:"灾难",
    },
    {
        value:"青春",
        label:"青春",
    },
    {
        value:"儿童",
        label:"儿童",
    },
    {
        value:"其他",
        label:"其他",
    },
])


const movieAreaOption=ref([
        {
            value:"大陆",
            label:"大陆",
        },
        {
            value:"美国",
            label:"美国",
        },
        {
            value:"韩国",
            label:"韩国",
        },
        {
            value:"日本",
            label:"日本",
        },
        {
            value:"中国香港",
            label:"中国香港",
        },
        {
            value:"中国台湾",
            label:"中国台湾",
        },
        {
            value:"泰国",
            label:"泰国",
        },
        {
            value:"印度",
            label:"印度",
        },
        {
            value:"法国",
            label:"法国",
        },
        {
            value:"英国",
            label:"英国",
        },
        {
            value:"俄罗斯",
            label:"俄罗斯",
        },
        {
            value:"意大利",
            label:"意大利",
        },
        {
            value:"西班牙",
            label:"西班牙",
        },
        {
            value:"德国",
            label:"德国",
        },
        {
            value:"波兰",
            label:"波兰",
        },
        {
            value:"澳大利亚",
            label:"澳大利亚",
        },
        {
            value:"伊朗",
            label:"伊朗",
        },
        {
            value:"其他",
            label:"其他",
        },

    ])

const theaterOptions=ref([
    {
        value:"杜比全景声厅",
        label:"杜比全景声厅",
    },
    {
        value:"IMAX厅",
        label:"IMAX厅",
    },
    {
        value:"RealD厅",
        label:"RealD厅",
    },
    {
        value:"巨幕影厅",
        label:"巨幕影厅",
    },
    {
        value:"4DX影厅",
        label:"4DX影厅",
    },
    {
        value:"杜比影院",
        label:"杜比影院",
    },
    {
        value:"激光放映厅",
        label:"激光放映厅",
    },
    {
        value:"儿童影厅",
        label:"儿童影厅",
    },
    {
        value:"其他",
        label:"其他",
    },

])

export {movieTypeOption,provincesData,movieAreaOption,theaterOptions} ;